import React from 'react';
import headerStyle from '../assets/Vector1.png';

function Feature() {
  return (
    <section className='feature'>
      <div className='feature__wrapper'>
        <h2 className='feature__header header__section-title'>
          Чому саме у нас?<img src={headerStyle} className='title-element'></img>
        </h2>
        <ul className='feature__list'>
          <li className='feature__item'>
            <div className='feature__img'>
              <svg
                width='37'
                height='37'
                viewBox='0 0 37 37'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'>
                <path
                  d='M31.3235 6.13897L19.0456 1.95479C18.8975 1.9042 18.6987 1.87891 18.5 1.87891C18.3013 1.87891 18.1025 1.9042 17.9544 1.95479L5.67647 6.13897C5.37656 6.24014 5.13086 6.58701 5.13086 6.90498V24.3355C5.13086 24.6534 5.33682 25.0726 5.58613 25.2713L18.0411 34.9766C18.1676 35.0741 18.3302 35.1247 18.4964 35.1247C18.6626 35.1247 18.8288 35.0741 18.9517 34.9766L31.4066 25.2713C31.656 25.0762 31.8619 24.657 31.8619 24.3355V6.90498C31.8691 6.58701 31.6234 6.24375 31.3235 6.13897ZM25.0942 12.3105L17.4124 22.8865C17.3584 22.9604 17.2877 23.0206 17.2061 23.062C17.1245 23.1035 17.0342 23.1251 16.9427 23.1251C16.8511 23.1251 16.7609 23.1035 16.6793 23.062C16.5976 23.0206 16.527 22.9604 16.4729 22.8865L11.9058 16.5994C11.7685 16.4079 11.9058 16.1405 12.1406 16.1405H14.1352C14.3194 16.1405 14.4965 16.2309 14.6049 16.379L16.9427 19.5948L22.3951 12.0864C22.5035 11.9383 22.677 11.8479 22.8648 11.8479H24.8594C25.0942 11.8516 25.2315 12.1189 25.0942 12.3105Z'
                  fill='#FE5F55'
                  fillOpacity='0.7'
                />
              </svg>
            </div>
            <h3 className='feature__item-title'>Сертифікат безпеки ДСТУ 1724-92</h3>
            <p className='feature__item-text'>
              Висновок державної служби України з питань безпечності харчових продуктів та захисту
              споживачів
            </p>
          </li>
          <li className='feature__item'>
            <div className='feature__img'>
              <svg
                className='obmen'
                width='50'
                height='50'
                viewBox='0 0 50 50'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'>
                <path
                  d='M25 50C11.1925 50 0 38.8075 0 25C0 11.1925 11.1925 0 25 0C38.8075 0 50 11.1925 50 25C50 38.8075 38.8075 50 25 50ZM25 45C30.3043 45 35.3914 42.8929 39.1421 39.1421C42.8929 35.3914 45 30.3043 45 25C45 19.6957 42.8929 14.6086 39.1421 10.8579C35.3914 7.10714 30.3043 5 25 5C19.6957 5 14.6086 7.10714 10.8579 10.8579C7.10714 14.6086 5 19.6957 5 25C5 30.3043 7.10714 35.3914 10.8579 39.1421C14.6086 42.8929 19.6957 45 25 45ZM12.5 27.5H35V32.5H25V40L12.5 27.5ZM25 17.5V10L37.5 22.5H15V17.5H25Z'
                  fill='#FE5F55'
                  fillOpacity='0.7'
                />
              </svg>
            </div>
            <h3 className='feature__item-title'>Обмін та повернення протягом 14 днів</h3>
            <p className='feature__item-text'>Ви нічим не ризикуєте, коли замовите ялинку у нас</p>
          </li>
          <li className='feature__item'>
            <div className='feature__img'>2</div>
            <h3 className='feature__item-title'>роки гарантії</h3>
            <p className='feature__item-text'>
              На конструкцію ялинки. Замінимо товар на новий у випадку виробничого браку
            </p>
          </li>
          <li className='feature__item'>
            <div className='feature__img'>
              <svg
                width='36'
                height='36'
                viewBox='0 0 36 36'
                fill='none'
                xmlns='http://www.w3.org/2000/svg'>
                <path
                  d='M0 6.75V9H21.375V25.875H14.4495C13.9478 23.9411 12.2085 22.5 10.125 22.5C8.0415 22.5 6.30225 23.9411 5.8005 25.875H4.5V20.25H2.25V28.125H5.8005C6.30225 30.0589 8.0415 31.5 10.125 31.5C12.2085 31.5 13.9478 30.0589 14.4495 28.125H23.8005C24.3022 30.0589 26.0415 31.5 28.125 31.5C30.2085 31.5 31.9478 30.0589 32.4495 28.125H36V18.9495L35.9291 18.7729L33.6791 12.0229L33.435 11.25H23.625V6.75H0ZM1.125 11.25V13.5H11.25V11.25H1.125ZM23.625 13.5H31.8161L33.75 19.2656V25.875H32.4495C31.9478 23.9411 30.2085 22.5 28.125 22.5C26.0415 22.5 24.3022 23.9411 23.8005 25.875H23.625V13.5ZM2.25 15.75V18H9V15.75H2.25ZM10.125 24.75C11.3816 24.75 12.375 25.7434 12.375 27C12.375 28.2566 11.3816 29.25 10.125 29.25C8.86837 29.25 7.875 28.2566 7.875 27C7.875 25.7434 8.86837 24.75 10.125 24.75ZM28.125 24.75C29.3816 24.75 30.375 25.7434 30.375 27C30.375 28.2566 29.3816 29.25 28.125 29.25C26.8684 29.25 25.875 28.2566 25.875 27C25.875 25.7434 26.8684 24.75 28.125 24.75Z'
                  fill='#FE5F55'
                  fillOpacity='0.7'
                />
              </svg>
            </div>
            <h3 className='feature__item-title'>
              Без передоплати з доставкою по Україні за 2-3 дні
            </h3>
            <p className='feature__item-text'>
              Відправляємо Новою Поштою. Замовляйте накладним платежем!
            </p>
          </li>
        </ul>
      </div>
    </section>
  );
}

export default Feature;
